# simulating the lazy evaluator

Consider the following evaluated in my lazy evaluator

```
(define count 0)

(define (id x)
  (set! count (+ count 1))
  x)

(define w (id (id 10)))

;;; LAZY-DAN input:
count

;;; LAZY-DAN value:
0

;;; LAZY-DAN input:
w

;;; LAZY-DAN value:
10

;;; LAZY-DAN input:
count

;;; LAZY-DAN value:
2
```

After running my evaluator in the lazy evaluator, it was wrong. 

The first time count is called, the value is 1. 
I assume that when w is defined the outer id procedure is called, and 
count is incremented by one. 

I ran the following test which backs this up:

```
> (define count 0)
'ok
> (define z (id (id (id (id 23)))))
'ok
> count
1
> z
23
> count
4
```

I believe that my scheme behaves in this manner because it forces the actual
value of the first operator when w or z is defined.
